<?php

use Illuminate\Database\Seeder;

class CharacterModelTypesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        
        $types = self::prepare();
        
        foreach ($types as $type){
            
            $character_model_type = new App\CharacterModelType();
            $character_model_type->character_model_id = $type[0];
            $character_model_type->model_type_name = $type[1];
            $character_model_type->init_lv = $type[2];
            $character_model_type->hp = $type[3];
            $character_model_type->mp = $type[4];
            $character_model_type->sp = $type[5];
            
            $character_model_type->stab = $type[6];
            $character_model_type->hack = $type[8];
            $character_model_type->int = $type[10];
            $character_model_type->def = $type[12];
            $character_model_type->mr = $type[14];
            $character_model_type->dex = $type[16];
            $character_model_type->agi = $type[18];
            
            $character_model_type->save();
        }
    }
    
    
    private static function prepare()
    {
        $types = [];
        $types[] = explode(',', '1,物理複合,1,220,50,1000,4,1,3,1,1,3,2,2,1,3,2,2,2,2');
        $types[] = explode(',', '1,斬り型,1,240,55,900,3,2,4,1,1,3,3,1,1,3,2,2,1,2');
        $types[] = explode(',', '1,突き型,1,200,55,1100,4,1,3,2,1,3,1,2,1,3,2,2,3,1');
        $types[] = explode(',', '2,物理複合,1,200,50,950,3,2,4,1,1,3,3,1,2,3,1,2,1,2');
        $types[] = explode(',', '2,斬り型,1,200,55,900,2,2,5,1,1,3,3,1,2,2,1,2,1,2');
        $types[] = explode(',', '2,魔剣士型,1,185,65,850,2,3,4,1,2,1,2,2,2,3,2,1,1,2');
        $types[] = explode(',', '3,突き型,1,190,45,1200,4,1,2,2,1,3,2,2,1,3,3,1,2,2');
        $types[] = explode(',', '3,物理複合,1,210,50,1100,4,1,3,1,1,3,2,2,1,3,2,2,2,2');
        $types[] = explode(',', '3,斬り型,1,200,55,1000,2,2,4,1,1,3,2,2,1,3,3,1,2,2');
        $types[] = explode(',', '4,物理複合,1,190,50,950,4,1,4,1,1,3,2,2,1,3,2,2,1,2');
        $types[] = explode(',', '4,斬り型,1,210,55,900,3,2,5,1,1,3,2,2,1,3,2,2,1,1');
        $types[] = explode(',', '4,魔剣士型,1,175,65,850,2,3,4,1,2,1,2,3,2,2,2,1,1,2');
        $types[] = explode(',', '5,攻撃型,1,160,80,800,1,3,2,2,4,2,1,3,3,2,2,1,2,1');
        $types[] = explode(',', '5,補助型,1,170,90,900,1,3,2,3,2,2,2,2,3,1,2,2,3,1');
        $types[] = explode(',', '5,戦闘型,1,180,70,1100,1,1,3,1,1,3,3,3,2,2,2,2,3,1');
        $types[] = explode(',', '6,突き型,1,185,40,1400,4,1,2,2,1,3,1,2,1,3,3,2,3,1');
        $types[] = explode(',', '6,物理複合,1,205,45,1300,4,1,3,1,1,3,1,2,1,3,3,2,2,2');
        $types[] = explode(',', '6,斬り型,1,225,50,1200,2,2,4,1,1,3,1,2,1,3,4,1,2,2');
        $types[] = explode(',', '7,突き型,1,220,45,1300,5,1,2,2,1,3,3,1,1,3,2,2,1,2');
        $types[] = explode(',', '7,物理複合,1,240,40,1200,4,1,4,1,1,3,3,2,1,3,1,2,1,2');
        $types[] = explode(',', '7,斬り型,1,260,40,1100,2,2,5,1,1,3,4,1,1,3,1,2,1,2');
        $types[] = explode(',', '8,斬り型,1,210,35,1000,2,2,4,1,1,3,1,2,2,3,3,2,2,1');
        $types[] = explode(',', '8,物理複合,1,190,40,1100,4,1,4,1,1,3,1,2,1,3,2,2,2,2');
        $types[] = explode(',', '8,突き型,1,170,35,1200,4,1,2,2,1,3,1,2,2,3,3,1,2,2');
        $types[] = explode(',', '9,強化型,1,220,60,930,4,1,2,2,3,3,1,1,3,3,1,2,1,2');
        $types[] = explode(',', '9,変化型,1,220,70,920,3,2,1,3,3,2,2,2,3,1,2,2,1,2');
        $types[] = explode(',', '9,放出型,1,220,75,910,3,2,1,3,4,1,1,3,3,2,2,1,1,2');
        $types[] = explode(',', '10,炎術型,1,180,80,800,1,3,2,2,4,1,1,1,3,2,2,1,2,2');
        $types[] = explode(',', '10,水術型,1,170,90,900,1,3,2,2,3,1,2,2,4,1,2,1,2,2');
        $types[] = explode(',', '10,雷術型,1,180,70,1000,1,3,2,2,3,1,1,1,3,1,3,2,2,2');
        $types[] = explode(',', '11,物理型,1,220,60,930,4,1,2,2,2,3,1,1,3,3,2,2,1,2');
        $types[] = explode(',', '11,魔法型,1,210,70,920,2,2,1,3,4,1,2,2,3,2,2,2,1,2');
        $types[] = explode(',', '11,補助型,1,200,80,910,3,2,1,3,3,2,1,3,3,1,2,1,2,2');
        $types[] = explode(',', '12,近接型,1,220,45,920,5,1,2,2,1,3,2,2,1,3,2,2,2,1');
        $types[] = explode(',', '12,気功型,1,200,35,850,2,2,5,1,1,2,2,2,1,3,2,2,2,1');
        $types[] = explode(',', '12,反撃型,1,260,40,900,3,1,3,1,1,4,4,1,1,2,2,2,1,3');
        $types[] = explode(',', '13,魔法人形型,1,220,60,930,2,3,1,3,4,1,3,1,1,2,2,1,2,2');
        $types[] = explode(',', '13,破壊精霊型,1,200,80,910,1,3,2,2,4,1,3,3,1,2,3,1,1,1');
        $types[] = explode(',', '13,守護精霊型,1,200,80,910,1,3,2,3,1,2,3,2,4,1,3,2,1,1');
        $types[] = explode(',', '14,ティエラ型,1,219,55,900,3,2,5,1,1,3,2,1,1,2,2,1,2,2');
        $types[] = explode(',', '14,神聖チャント型,1,170,100,900,1,3,2,3,1,2,2,2,5,1,2,2,1,1');
        $types[] = explode(',', '15,霊魂型,1,280,70,1200,2,2,4,1,1,2,3,2,3,1,2,2,2,2');
        $types[] = explode(',', '16,呪術系,200,1045,2800,8000,1,4,2,3,135,8,65,5,2,3,200,10,200,11');
        $types[] = explode(',', '17,工学系,200,1035,750,7000,135,8,2,3,1,4,65,5,1,4,200,11,200,11');
        $types[] = explode(',', '18,魔力活性,1,210,60,1000,3,2,4,1,1,2,2,2,1,3,3,2,2,1');
        
        return $types;
    }
}